-- -*- M2-comint -*- {* hash: -1285962778 *}
--loading configuration for package "PHCpack" from file /Users/elizabeth/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);
calling phc -c < /tmp/M2-6570-3PHCbatch > /tmp/M2-6570-4PHCsession
output of phc -c is in file /tmp/M2-6570-2PHCoutput

i4 : toString fe1

o4 = {x^2-y+(.811714-.584055*ii)*zz1, x^3-z+(-.76395-.645275*ii)*zz1, zz1,
     (.926605-.376035*ii)*x+(.209461-.977817*ii)*y+(-.179821-.983699*ii)*z
     +(-.755952-.654628*ii)*zz1-.998793-.0491177*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);
calling phc -c < /tmp/M2-6570-7PHCbatch > /tmp/M2-6570-8PHCsession
output of phc -c is in file /tmp/M2-6570-6PHCoutput

i8 : toString fe1

o8 = {x^2-y+(.458838-.897099*ii)*ss1+(.682853+.730556*ii)*zz1,
     x^3-z+(-.157271-.314759*ii)*ss1+(.724124+.68967*ii)*zz1,
     x*y-z+(.985419+.74094*ii)*ss1+(-.308302-.951288*ii)*zz1,
     -y^2+x*z+(-.366379-.0615438*ii)*ss1+(.842381-.538882*ii)*zz1,
     (-.465958-.884807*ii)*x+(-.462019-.88687*ii)*y+(-.914912-.403653*ii)*z
     +(.93775-.347311*ii)*ss1+(.296008+.955185*ii)*zz1-.427499-.904016*ii}

i9 : 
