-- -*- M2-comint -*- {* hash: -1285962778 *}
--loading configuration for package "PHCpack" from file /Users/elizabeth/Library/Application Support/Macaulay2/init-PHCpack.m2
--warning: symbol "Verbose" in Core.Dictionary is shadowed by a symbol in PHCpack.Dictionary
--  use the synonym Core$Verbose

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);
calling phc -c < /tmp/M2-5150-3PHCbatch > /tmp/M2-5150-4PHCsession
output of phc -c is in file /tmp/M2-5150-2PHCoutput

i4 : toString fe1

o4 = {x^2-y+(-.652135-.758102*ii)*zz1, x^3-z+(.999436-.0335794*ii)*zz1, zz1,
     (-.839864-.542797*ii)*x+(-.133804+.991008*ii)*y+(-.0558135-.998441*ii)*z
     +(.71089-.703303*ii)*zz1-.651451+.758691*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);
calling phc -c < /tmp/M2-5150-7PHCbatch > /tmp/M2-5150-8PHCsession
output of phc -c is in file /tmp/M2-5150-6PHCoutput

i8 : toString fe1

o8 = {x^2-y+(.89152-.919326*ii)*ss1+(-.480776-.876844*ii)*zz1,
     x^3-z+(.151497-.230966*ii)*ss1+(-.457845-.889032*ii)*zz1,
     x*y-z+(-.248529+.213349*ii)*ss1+(.634435+.772976*ii)*zz1,
     -y^2+x*z+(-.39309+.976475*ii)*ss1+(-.535713+.8444*ii)*zz1,
     (.50994-.86021*ii)*x+(-.639622-.768689*ii)*y+(.532555-.846396*ii)*z
     +(-.986062-.166375*ii)*ss1+(-.730758-.682637*ii)*zz1+.993299+.115571*ii}

i9 : 
