-- -*- M2-comint -*- {* hash: -1924333600 *}
--loading configuration for package "PHCpack" from file /Users/petrovic/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f

             3 5    2     2   2
o3 = ideal (x y  + x y + y , x  + x*y - 1)

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /tmp/M2-5174-1PHCinput and /tmp/M2-5174-1PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,stableMV=>true)
using temporary files /tmp/M2-5174-2PHCinput and /tmp/M2-5174-2PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,startSystem=>true);
using temporary files /tmp/M2-5174-3PHCinput and /tmp/M2-5174-3PHCoutput

i9 : q --let's take a look at the start system:

                             3 5                          2                
o9 = {(.728837 - .684688*ii)x y  + (.973828 + .227286*ii)x y + (- .976956 +
     ------------------------------------------------------------------------
                 2                        2
     1.74515*ii)y , (.44653 - .894768*ii)x  + (- .617445 - .786614*ii)x*y +
     ------------------------------------------------------------------------
     1.47976 + 1.34547*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.646817-.392041*ii, .597831+.070632*ii}, {-.537105+.902622*ii,
      -----------------------------------------------------------------------
      .429286-.626667*ii}, {.0288432-.256438*ii, .824626+3.80858*ii},
      -----------------------------------------------------------------------
      {-1.14526+.953079*ii, .771425+.289597*ii}, {-1.15438+.260242*ii,
      -----------------------------------------------------------------------
      -.114404+.885928*ii}, {.82435-1.20233*ii, -.962744+.262992*ii},
      -----------------------------------------------------------------------
      {1.38479-.511964*ii, -.389985-.906534*ii}, {-.0480499+.246829*ii,
      -----------------------------------------------------------------------
      -1.15603-3.78453*ii}}

o10 : List

i11 : 
