-- -*- M2-comint -*- {* hash: -1229619679 *}
--loading configuration for package "PHCpack" from file /Users/petrovic/Library/Application Support/Macaulay2/init-PHCpack.m2
--warning: symbol "Verbose" in Core.Dictionary is shadowed by a symbol in PHCpack.Dictionary
--  use the synonym Core$Verbose

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /tmp/M2-9547-1PHCinput and /tmp/M2-9547-1PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)
using temporary files /tmp/M2-9547-2PHCinput and /tmp/M2-9547-2PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);
using temporary files /tmp/M2-9547-3PHCinput and /tmp/M2-9547-3PHCoutput

i9 : q --let's take a look at the start system:

                            3 5                          2              
o9 = {(.971549 + .23684*ii)x y  + (.765669 - .643234*ii)x y + (.999484 -
     ------------------------------------------------------------------------
                  2                           2
     .0321308*ii)y , (- .791378 - .611327*ii)x  + .773219 - .634139*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.782382-.622799*ii, .485718+.581043*ii}, {-.782382+.622799*ii,
      -----------------------------------------------------------------------
      .155966+.735188*ii}, {-.782382+.622799*ii, -.008369-1.21245*ii},
      -----------------------------------------------------------------------
      {.782382-.622799*ii, -.415616+.863354*ii}, {-.782382+.622799*ii,
      -----------------------------------------------------------------------
      .949179+.19484*ii}, {.782382-.622799*ii, -.961175-.736221*ii},
      -----------------------------------------------------------------------
      {.782382-.622799*ii, .891073-.708176*ii}, {-.782382+.622799*ii,
      -----------------------------------------------------------------------
      -1.09678+.282419*ii}}

o10 : List

i11 : 
