-- -*- M2-comint -*- {* hash: -1715183444 *}
--loading configuration for package "PHCpack" from file /Users/elizabeth/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f

             3 5    2     2   2
o3 = ideal (x y  + x y + y , x  + x*y - 1)

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /tmp/M2-5279-1PHCinput and /tmp/M2-5279-1PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)
using temporary files /tmp/M2-5279-2PHCinput and /tmp/M2-5279-2PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);
using temporary files /tmp/M2-5279-3PHCinput and /tmp/M2-5279-3PHCoutput

i9 : q --let's take a look at the start system:

                             3 5                          2               
o9 = {(.981516 - .191378*ii)x y  + (.817324 - .576179*ii)x y, (- .990981 +
     ------------------------------------------------------------------------
                 2
     .134002*ii)x  + .987281 - .158983*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{-.99992+.012627*ii, .994781-.102035*ii}, {.99992-.012627*ii,
      -----------------------------------------------------------------------
      .775566+.631266*ii}, {-.99992+.012627*ii, .102035+.994781*ii},
      -----------------------------------------------------------------------
      {.99992-.012627*ii, -.631266+.775566*ii}, {-.99992+.012627*ii,
      -----------------------------------------------------------------------
      -.994781+.102035*ii}, {.99992-.012627*ii, -.775566-.631266*ii},
      -----------------------------------------------------------------------
      {-.99992+.012627*ii, -.102035-.994781*ii}, {.99992-.012627*ii,
      -----------------------------------------------------------------------
      .631266-.775566*ii}}

o10 : List

i11 : 
