-- -*- M2-comint -*- {* hash: -1229619679 *}
--loading configuration for package "PHCpack" from file /Users/elizabeth/Library/Application Support/Macaulay2/init-PHCpack.m2
--warning: symbol "Verbose" in Core.Dictionary is shadowed by a symbol in PHCpack.Dictionary
--  use the synonym Core$Verbose

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /tmp/M2-5222-1PHCinput and /tmp/M2-5222-1PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)
using temporary files /tmp/M2-5222-2PHCinput and /tmp/M2-5222-2PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);
using temporary files /tmp/M2-5222-3PHCinput and /tmp/M2-5222-3PHCoutput

i9 : q --let's take a look at the start system:

                               3 5                           2               
o9 = {(- .102135 + .994771*ii)x y  + (- .90772 + .419577*ii)x y, (- .398389 +
     ------------------------------------------------------------------------
                 2
     .917217*ii)x  + (.442562 - .896738*ii)x*y - .88714 - .4615*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.798638-.1971*ii, .471827+.938055*ii}, {.329647-.519419*ii,
      -----------------------------------------------------------------------
      -1.08665+.306831*ii}, {-.503215+.321121*ii, .443945-1.04748*ii},
      -----------------------------------------------------------------------
      {1.25661-.824418*ii, .838278-.336148*ii}, {-.259283+.853473*ii,
      -----------------------------------------------------------------------
      .861926+.56205*ii}, {-.981605+1.16541*ii, -.412895+.799771*ii},
      -----------------------------------------------------------------------
      {-1.18087+.387696*ii, -.893449-.31422*ii}, {.540071-1.18676*ii,
      -----------------------------------------------------------------------
      -.222983-.908864*ii}}

o10 : List

i11 : 
