-- -*- M2-comint -*- {* hash: -1229619679 *}

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/0PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/0PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/1PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/1PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/2PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27877-0/2PHCoutput

i9 : q --let's take a look at the start system:

                               3 5                            2              
o9 = {(- .152604 - .988287*ii)x y  + (- .939801 + .341723*ii)x y + (- .716575
     ------------------------------------------------------------------------
                  2                          2
     - .69751*ii)y , (- .38563 + .922654*ii)x  - .160922 - .986967*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.961398-.275161*ii, -.172009+.758293*ii}, {-.961398+.275161*ii,
      -----------------------------------------------------------------------
      .196064+.711385*ii}, {.961398-.275161*ii, .716447+.585794*ii},
      -----------------------------------------------------------------------
      {-.961398+.275161*ii, -.489412-1.11384*ii}, {-.961398+.275161*ii,
      -----------------------------------------------------------------------
      1.09849-.189413*ii}, {.961398-.275161*ii, -1.11792-.284706*ii},
      -----------------------------------------------------------------------
      {.961398-.275161*ii, .573482-1.05938*ii}, {-.961398+.275161*ii,
      -----------------------------------------------------------------------
      -.805139+.591866*ii}}

o10 : List

i11 : 
