-- -*- M2-comint -*- {* hash: -1924333600 *}
--loading configuration for package "PHCpack" from file /Users/petrovic/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f

             3 5    2     2   2
o3 = ideal (x y  + x y + y , x  + x*y - 1)

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)
using temporary files /tmp/M2-1329-1PHCinput and /tmp/M2-1329-1PHCoutput

o6 = 8

i7 : (mv,sv) = mixedVolume(f,stableMV=>true)
using temporary files /tmp/M2-1329-2PHCinput and /tmp/M2-1329-2PHCoutput

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,startSystem=>true);
using temporary files /tmp/M2-1329-3PHCinput and /tmp/M2-1329-3PHCoutput

i9 : q --let's take a look at the start system:

                             3 5                         2              
o9 = {(.885334 - .464956*ii)x y  + (.97087 + .239608*ii)x y + (.257109 +
     ------------------------------------------------------------------------
                2                           2
     1.9834*ii)y , (- .411537 + .911393*ii)x  + (- .950942 + .309368*ii)x*y +
     ------------------------------------------------------------------------
     1.0353 + 1.71118*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.502963+.200417*ii, .569379+1.75211*ii}, {.103661+.938452*ii,
      -----------------------------------------------------------------------
      .287927-.681551*ii}, {-.434096-.614186*ii, -.485541-.407612*ii},
      -----------------------------------------------------------------------
      {-.925205-1.2471*ii, .954058-.100332*ii}, {-.042939-1.31981*ii,
      -----------------------------------------------------------------------
      .262105+1.00515*ii}, {.97752+.898284*ii, -.69981+.542026*ii},
      -----------------------------------------------------------------------
      {.432417+1.38051*ii, -.622486-.558697*ii}, {-.614323-.23657*ii,
      -----------------------------------------------------------------------
      -.265632-1.55109*ii}}

o10 : List

i11 : 
