-- -*- M2-comint -*- {* hash: -1741985194 *}
--loading configuration for package "PHCpack" from file /Users/petrovic/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : S = {x+y+z-1,x^2+y^2,x+y-z-3}

                      2    2
o2 = {x + y + z - 1, x  + y , x + y - z - 3}

o2 : List

i3 : L = phcSolve(S)
using temporary files /tmp/M2-5160-1PHCinput and /tmp/M2-5160-1PHCoutput

o3 = {{1+ii, 1-ii, -1}, {1-ii, 1+ii, -1}}

o3 : List

i4 : oneSoln = L_0

o4 = {1+ii, 1-ii, -1}

o4 : Point

i5 : peek oneSoln

o5 = Point{ConditionNumber => 6.32111     }
           Coordinates => {1+ii, 1-ii, -1}
           LastT => 1
           SolutionStatus => Regular

i6 : I = ideal(y-x^2,z-x^3,x^2-y)

               2         3       2
o6 = ideal (- x  + y, - x  + z, x  - y)

o6 : Ideal of R

i7 : dim I

o7 = 1

i8 : system = flatten entries gens I

         2         3       2
o8 = {- x  + y, - x  + z, x  - y}

o8 : List

i9 : vol = mixedVolume(system) -- this returns zero, not so useful
using temporary files /tmp/M2-5160-2PHCinput and /tmp/M2-5160-2PHCoutput

o9 = 0

i10 : phcSolve(system)
using temporary files /tmp/M2-5160-3PHCinput and /tmp/M2-5160-3PHCoutput

o10 = {(2.09881e-16-4.14836e-16*ii, 1.43602e-31-4.12544e-31*ii,
      -----------------------------------------------------------------------
      1.05539e-31+3.17302e-31*ii)}

o10 : List

i11 : dim trim I

o11 = 1

i12 : system={y-x^2, z-x^3,x+y+z-1,x+y+ x^3 -1}

          2         3                      3
o12 = {- x  + y, - x  + z, x + y + z - 1, x  + x + y - 1}

o12 : List

i13 : #system > numcols vars R --overdetermined system

o13 = true

i14 : solns =phcSolve(system);
using temporary files /tmp/M2-5160-4PHCinput and /tmp/M2-5160-4PHCoutput

i15 : numSolns = #solns

o15 = 3

i16 : 
