-- -*- M2-comint -*- {* hash: -1010838168 *}
--loading configuration for package "PHCpack" from file /Users/petrovic/Library/Application Support/Macaulay2/init-PHCpack.m2
--warning: symbol "Verbose" in Core.Dictionary is shadowed by a symbol in PHCpack.Dictionary
--  use the synonym Core$Verbose

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)
... calling constructEmbedding ...
calling phc -c < /tmp/M2-9580-3PHCbatch > /tmp/M2-9580-4PHCsession
output of phc -c is in file /tmp/M2-9580-2PHCoutput
... calling solveSystem ...
using temporary files /tmp/M2-9580-5PHCinput and /tmp/M2-9580-5PHCoutput
... constructing a witness set ... 

o3 = ([dim=1,deg=3], {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.988365-.152099*ii)*zz1, x^3-z+(-.926961-.375158*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(.711187+.703003*ii)*x+(-.785845+.618423*ii)*y+(.967016+.254716*ii)*z
     +(.920389-.391003*ii)*zz1-.995588+.093837*ii}

i8 : toString points(w)

o8 = VerticalList{{.277679-1.02502*ii, -.97356-.569252*ii,
     -.853832+.83985*ii, 0}, {.594349-.733485*ii, -.18475-.871892*ii,
     -.749326-.382697*ii, 0}, {-.269625+.960313*ii, -.849503-.517849*ii,
     .726344-.676163*ii, 0}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);
... calling constructEmbedding ...
calling phc -c < /tmp/M2-9580-8PHCbatch > /tmp/M2-9580-9PHCsession
output of phc -c is in file /tmp/M2-9580-7PHCoutput
... calling solveSystem ...
using temporary files /tmp/M2-9580-10PHCinput and /tmp/M2-9580-10PHCoutput
... constructing a witness set ... 

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
