-- -*- M2-comint -*- {* hash: -1010838168 *}
--loading configuration for package "PHCpack" from file /Users/elizabeth/Library/Application Support/Macaulay2/init-PHCpack.m2
--warning: symbol "Verbose" in Core.Dictionary is shadowed by a symbol in PHCpack.Dictionary
--  use the synonym Core$Verbose

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)
... calling constructEmbedding ...
calling phc -c < /tmp/M2-5256-3PHCbatch > /tmp/M2-5256-4PHCsession
output of phc -c is in file /tmp/M2-5256-2PHCoutput
... calling solveSystem ...
using temporary files /tmp/M2-5256-5PHCinput and /tmp/M2-5256-5PHCoutput
... constructing a witness set ... 

o3 = ([dim=1,deg=3], {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(-.979061-.203565*ii)*zz1, x^3-z+(.597761-.801674*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(.608248-.793747*ii)*x+(.0174673+.999847*ii)*y+(.988681+.150035*ii)*z
     +(.603268-.797539*ii)*zz1+.507851+.861445*ii}

i8 : toString points(w)

o8 = VerticalList{{-.748548-1.15473*ii, -.773088+1.72875*ii,
     2.57494-.401339*ii, 2.18462e-32+1.68742e-32*ii}, {.369628+.891461*ii,
     -.658079+.659018*ii, -.830733-.34306*ii, -1.09258e-32+2.04424e-33*ii},
     {.211638-.722636*ii, -.477412-.305875*ii, -.322074+.28026*ii,
     -2.19952e-33-6.9088e-35*ii}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);
... calling constructEmbedding ...
calling phc -c < /tmp/M2-5256-8PHCbatch > /tmp/M2-5256-9PHCsession
output of phc -c is in file /tmp/M2-5256-7PHCoutput
... calling solveSystem ...
using temporary files /tmp/M2-5256-10PHCinput and /tmp/M2-5256-10PHCoutput
... constructing a witness set ... 

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
