-- -*- M2-comint -*- {* hash: -1010838168 *}

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)
... calling constructEmbedding ...
calling phc -c < /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/2PHCbatch > /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/3PHCsession
output of phc -c is in file /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/1PHCoutput
... calling solveSystem ...
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/4PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/4PHCoutput
... constructing a witness set ... 

o3 = ([dim=1,deg=3], {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.521928+.85299*ii)*zz1, x^3-z+(.897187-.441651*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(.536254+.844056*ii)*x+(.0958199-.995399*ii)*y+(.958599-.284761*ii)*z
     +(-.814913-.579583*ii)*zz1-.307502-.951547*ii}

i8 : toString points(w)

o8 = VerticalList{{.155498-.844563*ii, -.689107-.262657*ii,
     -.328985+.541152*ii, 0}, {-1.05665+1.33326*ii, -.661073-2.81757*ii,
     4.45508+2.0958*ii, -2.58926e-33-1.06052e-32*ii}, {.525847+.438206*ii,
     .0844899+.460859*ii, -.157522+.279365*ii, 0}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);
... calling constructEmbedding ...
calling phc -c < /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/7PHCbatch > /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/8PHCsession
output of phc -c is in file /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/6PHCoutput
... calling solveSystem ...
using temporary files /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/9PHCinput and /var/folders/40/dy88l5qd361391m_3v2m51bm0000gn/T/M2-27910-0/9PHCoutput
... constructing a witness set ... 

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
